In [53]:
import pandas as pd

In [40]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9], [10,11,12]], index = ['A','B','C','D'], columns = ['C1','C2','C3'])
df

   C1  C2  C3
A   1   2   3
B   4   5   6
C   7   8   9
D  10  11  12

In [41]:
df.index.tolist()

['A', 'B', 'C', 'D']

In [45]:
df.index.sort_values(ascending=False)

Index(['D', 'C', 'B', 'A'], dtype='object', name='index')

In [46]:
df.reset_index(inplace=True)
df

  index  C1  C2  C3
0     A   1   2   3
1     B   4   5   6
2     C   7   8   9
3     D  10  11  12

In [47]:
df.set_index("index", inplace=True)
df

       C1  C2  C3
index
A       1   2   3
B       4   5   6
C       7   8   9
D      10  11  12

In [49]:
df.index.rename("INDEX", inplace=True)
df

       C1  C2  C3
INDEX
A       1   2   3
B       4   5   6
C       7   8   9
D      10  11  12

In [50]:
df.reset_index(drop=True, inplace=True)
df

   C1  C2  C3
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [54]:
df.set_index(pd.Series(["A", "B", "C", "D"]), inplace=True)
df

   C1  C2  C3
A   1   2   3
B   4   5   6
C   7   8   9
D  10  11  12